Revit 2027 API
BuiltInFailures.CurtainWallFailures.RuledCurtainElementLostCurves Property
 Ruled Curtain System cannot be built. The Lines or Edges used to create it cannot be found.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RuledCurtainElementLostCurves { get; }
Public Shared ReadOnly Property RuledCurtainElementLostCurves As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RuledCurtainElementLostCurves {
	FailureDefinitionId^ get ();
}
static member RuledCurtainElementLostCurves : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace